# parameters
nc: 1  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.50  # layer channel multiple

# anchors
anchors:
  - [116,90, 156,198, 373,326]  # P5/32
  - [30,61, 62,45, 59,119]  # P4/16
  - [10,13, 16,30, 33,23]  # P3/8

# YOLOv5 backbone: mobilenet v2
backbone:
  # [from, number, module, args]
  [[-1, 1, nn.Conv2d, [32, 3, 2]],  # 0-P1/2   oup, k, s     640
   [-1, 1, BottleneckMOB, [16, 1, 1]],  # 1-P2/4   oup, s, t 320
   [-1, 2, BottleneckMOB, [24, 2, 6]],  #                    320
   [-1, 1, PW_Conv, [256]],  #4  output p3                   160
   [-1, 3, BottleneckMOB, [32, 2, 6]],  # 3-P3/8             160
   [-1, 4, BottleneckMOB, [64, 1, 6]],  # 5                  80
   [-1, 1, PW_Conv, [512]],  #7 output p4  6                 40
   [-1, 3, BottleneckMOB, [96, 2, 6]],  # 7                  80
   [-1, 3, BottleneckMOB, [160, 1, 6,]], #                   40
   [-1, 1, BottleneckMOB, [320, 1, 6,]], #                   40
   [-1, 1, nn.Conv2d, [1280, 1, 1]],     #                   40
   [-1, 1, SPP, [1024, [5, 9, 13]]],  #11     #              40
  ]

# YOLOv5 head
head:
  [[-1, 3, BottleneckCSP, [1024, False]],  # 12             40

   [-1, 1, Conv, [512, 1, 1]],                      #       40
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],      #       40
   [[-1, 6], 1, Concat, [1]],  # cat backbone P4-7  #       80
   [-1, 3, BottleneckCSP, [512, False]],  # 16      #       80

   [-1, 1, Conv, [256, 1, 1]],                      #       80
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],      #       160
   [[-1, 3], 1, Concat, [1]],  # cat backbone P3-4          160
   [-1, 3, BottleneckCSP, [256, False]],            #       160
   [-1, 1, nn.Conv2d, [na * (nc + 5), 1, 1]],  # 21 (P3/8-small)   #        160

   [-2, 1, Conv, [256, 3, 2]],                     #       160
   [[-1, 17], 1, Concat, [1]],  # cat head P4      #       160
   [-1, 3, BottleneckCSP, [512, False]],           #       160
   [-1, 1, nn.Conv2d, [na * (nc + 5), 1, 1]],  # 25 (P4/16-medium)  #       160

   [-2, 1, Conv, [512, 3, 2]],                     #       160
   [[-1, 13], 1, Concat, [1]],  # cat head P5-13   #      160
   [-1, 3, BottleneckCSP, [1024, False]],          #      160
   [-1, 1, nn.Conv2d, [na * (nc + 5), 1, 1]],  # 29 (P5/32-large)           160

   [[21, 25, 29], 1, Detect, [nc, anchors]],  # Detect(P5, P4, P3)     nc:number class, na:number of anchors
  ]








